const works = `
<span class="ourWorks">خدمات ما</span>
<div class="allWorks">
        <div class="work work-postex">
            <div class="work--head">
                <img src="assets/images/postexBanner.jpeg" alt="postex">
                <div class="work--head--intro">
                    <strong>
                        پستکس
                    </strong>
                    <p>خدمات آنلاین پست به صورت درب تا درب  که در آن متقاضیان این امکان را خواهند داشت تا از بین سرویس های پستی، حمل و نقل شهری و حمل و نقل سنگین و با توجه به مقایسه قیمت، سرعت و کیفیت به انتخاب سرویس مورد نظر خود بپردازند را از ما بخواهید</p>
                </div>
            </div>
            <div class="work--more">
                <div class="moreBody">
                    <span class="full-intro">توضیحات کامل : </span>
                    <p>
                        با توجه به افزایش روزافزون استفاده از خدمات پستی به واسطه خریدهای آنلاین، تحویل بسته‌های پستی به شرکت‌های پست برای مردم و به ویژه آنلاین‌شاپ‌ها و مراکزی که ارسال پستی در حجم انبوه دارند، با توجه به ترافیک، مشغله‌ فراوان و وقت‌گیر بودن، به یکی از دغدغه‌های اصلی مردم تبدیل شده است
                        
                        
                        یکی از مهم‌ترین مزایای استفاده از پستکس، جمع‌آوری بسته‌های پستی از درب منازل و تحویل آن به شرکت‌های پستی است. این موضوع در مقایسه با استفاده مستقیم از شرکت‌های پستی، با توجه به آن‌که هزینه آن با تخفیف محاسبه شده و هزینه‌های رفت و آمد تا شرکت‌های پستی مورد نظر از فرایند ارسال حذف می‌شود، موجب صرفه‌جویی بسیاری در وقت و هزینه‌ها می‌شود .
                        
                        پستکس در زمینه ارائه خدمات درب تا درب داخلی پستی، این امکان را فراهم کرده، تا فرستنده، به شکل کاملا آنلاین، پیش از ارسال بسته خود، تنها با وارد کردن وزن، حجم، مبدا، مقصد و روش پرداخت خود مانند پیش کرایه، پس کرایه، پرداخت در محل، ارسال رایگان و خرید و فروش امن یا همان «امنیتو» به راحتی تشخیص دهد که کدام شرکت پستی، با چه سرویسی، در چه مدت زمانی و چه قیمتی مرسوله را به مقصد خواهد رساند.
                        همچنین فرستنده می‌تواند با خرید اعتبار سالیانه در سامانه پستکس از خدمات پس کرایه یا پرداخت توسط گیرنده استفاده کند. ضمن این‌که خدمات پیشکرایه و خرید و فروش امن، از همان لحظه ثبت نام برای پست داخلی فعال است.
                        مشتری می‌تواند در صورت ضرورت از خدمات بسته بندی و چاپ لیبل پستکس استفاده کند و بلافاصله پس از ثبت کالای خود، با دریافت کد رهگیری ، از طریق سرویس رهگیری پیامکی ، مرسوله خود را پیگیری کند
                        <br/><br/>
                        فراهم کردن ارسال بسته پستی به به اقصی نقاط دنیا به شکل درب تا درب و با قیمت قطعی است. در حال حاضر چندین شرکت عرضه کننده سرویس پست خارجی، در بخش پست بین المللی پستکس فعالیت می‌کنند که موجب پوشش پستکس در ۲۰۲ کشور دنیا شده است.
با استفاده از خدمات پست خارجی پستکس، مشتری می‌تواند به راحتی عکس کالای مد نظر خود را در سامانه پستکس بارگذاری کرده و شرکت سرویس دهنده را انتخاب کند، به این ترتیب پستکس تا یک ساعت بعد قیمت قطعی ارسال خارجی را اعلام کرده و پس از ثبت نهایی سفارش، اقدام به دریافت بسته پستی از درب منزل می‌کند. سپس پستکس بسته مورد نظر را به ستاد اجرایی شرکت پستی در کشور واسطه ارسال کرده و بسته پستی از آن ستاد از طریق سرویس‌های پست بین المللی از جمله DHL و FEDEX به کشور مقصد ارسال می‌شود. 
<br/><br/>
مشتریان پستکس، همچنین می‌توانند با استفاده از خدمات کالا رسان این سامانه، بسیاری از کالاهای سنگین خود را تا ۱۳۹ کیلوگرم، با قیمتی مناسب به اقصی نقاط کشور ارسال کنند. به این ترتیب که مشتریان، با ثبت موقعیت مکانی خود از طریق پستکس، اقدام به ارسال درخواست، به نزدیک‌ترین اتوبوس و شرکت‌های حمل و نقل کرده و با پذیرش درخواست از سوی راننده، حمل مرسوله آغاز می‌شود
                    </p>
                    <span class="video-header">ویدیو مربوطه : </span>
                    <video src="assets/videos/postex.mp4" controls></video>           
                </div>
                <span class="moreText">
                    ادامه توضیحات ...
                </span>
            </div>
        </div>
        <div class="work work-rahvar">
            <div class="work--head">
                <img src="assets/images/rahvarBanner.jpg" alt="rahvar">
                <div class="work--head--intro">
                    <strong>
                        ره وار
                    </strong>
                    <p>شما هم در تردد و سفر بین شهری مستمر خود به دنبال کسب درآمد بیشتر  و  پرداخت کارمزد و هزینه  کمتر به ارگانهای حمل و نقل سنتی و مجازی از طریق تاکسی خطی ، خودرو  شخصی ، مینی بوس و اتوبوس  هستید ؟. پس با ما باشید.</p>
                </div>
            </div>
            <div class="work--more">
                <div class="moreBody">
                    <span class="full-intro">توضیحات کامل : </span>
                    <p>
                        سامانه هوشمند جابجایی مسافر ره وار ، به عنوان اولین سیستم حمل و نقل بین شهری کشور می باشد. این سامانه دارای دو نسخه راننده و مسافر میباشدکه از کافه بازار قابل دانلود و نصب رایگان می باشد.<br/>
                        در این طرح ما با ارائه خدمات ویژه ، تخفیف حداکثری و تسهیل پرداخت اختصاصی در انواع بیمه نامه شخص ثالث ، بدنه ، حوادث ، تکمیلی گروهی ، عمر و بازنشستگی و دریافت مستمری مادام العمر با همکاری چند جانبه شرکت های بیمه ای برای رانندگان و مسافران متقاضی عضو سامانه ره وار را با هماهنگی مسئولین طرح هموار کرده ایم
                        <span>چرا باید از اپلیکیشن ره وار استفاده کنیم ؟</span>
                        <br/>

۱. کم کردن هزینه سفرهای برون شهری برای مسافرین .
 <br/><br/>
۲. سرعت بخشیدن به فرایند پیدا کردن وسیله مناسب برای سفر .
 <br/><br/>
۳. برنامه ریزی راحت و صرفه جویی در زمان برای افرادی که سفر های غیر مترقبه برای ایشان  پیش امد کرده است.
 <br/><br/>
۴. ایجادمنبع درامد جهت پرداخت هزینه سوخت و  غیره،  خودرو هایی که تک سرنشین بنا به هر دلیل کاری عزم سفر از شهری به شهر دیگر را دارند .
 <br/><br/>
۵. هماهنگ شدن مسافر و راننده بدون اتلاف وقت در هر لحظه که راننده یا مسافر تصمیم به شروع سفر دارند .
 <br/><br/>
۶. تنوع انتخاب برای راننده و هم برای مسافر از لحاظ نوع خودرو و نرخ سفر .
 <br/><br/>
توجه :
<br/>
قطعا تا به حال در خروجی شهر ها بخصوص کلان شهر ها مثل تهران با ترافیک سنگین مواجه شدید   علت چیست ؟
 <br/><br/>
علت مسافرینی هستند که بدون بر نامه ریزی تصمیم به سفر گرفته و در خروجی شهرها به انتظار خودرو یا اتوبوس ایستاده اند و موجبات به وجود امدن بار ترافیکی سنگین و تحمیل هزینه به دیگران و نیز اتلاف وقت و انرژی در شما می شوند ما این شرایط را عوض خواهیم کرد

                    </p>
                    <span class="video-header">ویدیو مربوطه : </span>
                    <video src="assets/videos/rahvar.mp4" controls></video>
                    <video src="assets/videos/rahvar2.mp4" controls></video>  
                    <video src="assets/videos/rahvar3.mp4" controls></video>           
                </div>
                <span class="moreText">
                    ادامه توضیحات ...
                </span>
            </div>
        </div>
        <div class="work work-iranish">
            <div class="work--head">
                <img src="assets/images/iranishBanner.png" alt="iranish">
                <div class="work--head--intro">
                    <strong>
                        ایرانیش
                    </strong>
                    <p>دنبال مغازه میگردی؟ پول کافی برای خرید مغازه نداری؟ ایرانیش بخر<br/>
                    پاساژ مجازی ایرانیش اولین و تنها ترین مجموعه خدماتی و تجاری در سطح ایران می باشد که علاوه بر معرفی یک مرکز جامع و کامل برای خرید هرگونه نیاز مشتری , راه را برای کسانی که میخواهند صاحب کسب و کار مجازی قانونی شوند و مالکیت آن را داشته باشند فراهم کرده است.</p>
                </div>
            </div>
            <div class="work--more">
                <div class="moreBody">
                    <span class="full-intro">توضیحات کامل : </span>
                    <p>
                    به زودی
                    </p>
                    <span class="video-header">ویدیو مربوطه : </span>          
                </div>
                <span class="moreText">
                    ادامه توضیحات ...
                </span>
            </div>
        </div>
    </div>`

const worksEvents = ()=>{
    const moreShow = document.querySelectorAll('.work--more .moreText');
    moreShow.forEach(more => {
        more.addEventListener('click' , (el)=>{
            const nextMore = el.target.previousElementSibling.classList;
            nextMore.toggle('active')
            if ([...nextMore].includes('active')){
                el.target.textContent = 'بستن توضیحات';
                el.target.parentElement.style.transform = 'translateY(0)';
            }
            else{
                el.target.textContent = 'ادامه توضیحات ...';
                el.target.parentElement.style.transform = 'translateY(-50px)';
            }
        })
    })
}

export {works,worksEvents}